In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
data={
    'alphabets':['a','a','b'],
    'numbers':[1,1,2]
}

In [4]:
data

{'alphabets': ['a', 'a', 'b'], 'numbers': [1, 1, 2]}

In [5]:
a=pd.DataFrame(data)

In [6]:
a

  alphabets  numbers
0         a        1
1         a        1
2         b        2

In [11]:
b=a.groupby('alphabets')

In [12]:
b.mean()

           numbers
alphabets
a                1
b                2

In [13]:
b.sum()

           numbers
alphabets
a                2
b                2

In [16]:
b.sum().iloc[0]

numbers    2
Name: a, dtype: int64

In [18]:
b.sum().min()

numbers    2
dtype: int64

In [19]:
b.describe()

          numbers
            count mean  std  min  25%  50%  75%  max
alphabets
a             2.0  1.0  0.0  1.0  1.0  1.0  1.0  1.0
b             1.0  2.0  NaN  2.0  2.0  2.0  2.0  2.0

In [20]:
b.describe().transpose()

alphabets        a    b
numbers count  2.0  1.0
        mean   1.0  2.0
        std    0.0  NaN
        min    1.0  2.0
        25%    1.0  2.0
        50%    1.0  2.0
        75%    1.0  2.0
        max    1.0  2.0